/* 
   Localizable.strings
   RSS Reader

   Created by Mateusz Bajer on 10.04.28.
   Copyright 2010 ANTiSoftware. All rights reserved.
 */
 
// GENERAL
"TabTitles" = "Channels;Saved;Browser;Settings;About";
"CancelBtnTitle" = "Cancel";
"OKBtnTitle" = "OK";
"LoadingAppIDErrorTitle" = "Obtaining application ID";
"LoadingBuiltInChannedlsErrorTitle" = "Loading built-in channels";

// CHANNELS
"ChannelsTitle" = "Channels";
"AddNewChannel" = "Add new channel...";
"RemovingChannelTitle" = "Removing channel";
"RemovingChannelMsg" = "Are you sure you want to remove the RSS channel? This cannot be undone.";
"RemoveBtnTitle" = "Remove";
"CannotAddChannel_HostNotReachable" = "Nieprawidłowy host";

// SAVED
"SavedTitle" = "Saved";

// CHANNEL/TOPIC
"EMailArticle" = "Email article";
"CopyURL" = "Copy URL";
"CopyContents" = "Copy article";
"Save" = "Save";
"SendingArticle" = "Article sent using %@";

// SETTINGS
"SettingsTitle" = "Settings";
"SettingsRefreshTimeout" = "Reload timeout";
"neverRefresh" = "manually";
"each1minute" = "every minute";
"each5minutes" = "each 5 minutes";
"each10minutes" = "each 10 minutes";
"each15minutes" = "each 15 minutes";
"each30minutes" = "each 30 minutes";
"SettingsRemoveNewsAfter" = "Remove articles";
"everyHour" = "every hour";
"neverRemove" = "never";
"after1day" = "after 1 day";
"after2days" = "after 2 days";
"after5days" = "after 5 days";
"after10days" = "after 10 days";
"after2weeks" = "after 2 weeks";
"after4weeks" = "after 4 weeks";
"SettingsOnlyWiFiConnection" = "Only WiFi connection";
"SettingsEnableAudioEffects" = "Enable audio effects";


// BROWSER
"BrowserTypeURL" = "Enter URL";
"CannotOpenPage" = "Unable to load web page";
"CannotOpenPageMsg" = "%@ is unable to load web page: could not find server.";
"PageLoadError" = "";

// ERRORS
"ErrorTitle" = "Error";
"ChannelErrorTitle" = "Error in channel %@";
"HTTPError" = "HTTP protocol error";
"EmptyArticleURL" = "No URL link defined for article.";
"NoConnectionAvailable" = "No connection to the Internet.";
"NoWiFiConnectionAvailable" = "No WiFi connection available.";





// SETTINGS
//"SettingsRemoveNewsAfter" = "Remove news after";
//"SettingsOnlyWiFiConnection" = "Only WiFi connection";
//"SettingsEnableAudioEffects" = "Enable audio effects";
//"SettingsRefreshTimeout" = "Refresh timeout";
